xrun(64): 24.09-s011: (c) Copyright 1995-2025 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.09-s011: Started on Feb 24, 2026 at 17:24:49 CET
xrun
	-f xrunArgs
		-clean
		-UNBUFFERED
		-cdslib ./cds.lib
		-errormax 50
		-status
		-nowarn DLNOHV
		-nowarn DLCLAP
		-v93
		-incdir /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/
		-ade
		-timescale 1ns/1ns
		-vtimescale 1ns/1ns
		-discipline logic
		-delay_mode None
		-novitalaccl
		-access r
		-noparamerr
		-amspartinfo ../psf/partition.info
		-rnm_partinfo
		-modelincdir /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/
		./spiceModels.scs
		./amsControlSpectre.scs
		-input ./probe.tcl
		-run
		-exit
		-xmsimargs "+amsrawdir ../psf"
		-simcompatible_ams spectre
		-name SAR.test_sar8:config
		-amsconnrules ConnRules_inhconn_full_fast_gnd
		+define+CDS_SELECT_CRS
		+define+CONNRULES_INHCONN_FULL_FAST_GND
		/usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/ConnRules_inhconn_full_fast_gnd.vams
		/usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/L2E_2_inhconn_gnd.vams
		/usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/E2L_2_inhconn_gnd.vams
		/usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/Bidir_2_inhconn_gnd.vams
		-allowredefinition
		-amsbind
		-top SAR.test_sar8:schematic
		-top cds_globals
		./netlist.vams
		-f ./textInputs
			-makelib SAR
			-specificunit digital_gene
			/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_gene/entity/vhdl.vhd
			-makelib SAR
			-view a1
			-specificunit digital_gene:a1
			/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_gene/a1/vhdl.vhd
			-endlib
			-makelib SAR
			-specificunit digital_part
			/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_part/entity/vhdl.vhd
			-makelib SAR
			-view a3
			-specificunit digital_part:a3
			/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_part/a3/vhdl.vhd
			-endlib
			-amscompilefile "file:/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/voltage_gene/verilogams/verilog.vams lib:SAR cell:voltage_gene view:verilogams"
			-amscompilefile "file:/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/save_es/verilogams/verilog.vams lib:SAR cell:save_es view:verilogams"
			-amscompilefile "file:/usr/local/XFAB/xh018/diglibs/D_CELLS_3V/v2_1/cadence_IC61/v2_1_1_1/D_CELLS_3V/NA2_3VX1/verilogams/verilog.vams lib:D_CELLS_3V cell:NA2_3VX1 view:verilogams"
			-amscompilefile "file:/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/switched_comparator/verilogams/verilog.vams lib:SAR cell:switched_comparator view:verilogams"
			-amscompilefile "file:/usr/local/XFAB/xh018/diglibs/D_CELLS_3V/v2_1/cadence_IC61/v2_1_1_1/D_CELLS_3V/IN_3VX4/verilogams/verilog.vams lib:D_CELLS_3V cell:IN_3VX4 view:verilogams"
		./cds_globals.vams
		-l ../psf/xrun.log
		-spectre_args +aps
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_gene/entity/vhdl.vhd:
	errors: 0, warnings: 0
xmvhdl_p: Memory Usage - Current physical: 20.7M, Current virtual: 38.3M, Peak physical: 20.7M
\SAR\.DIGITAL_GENE (entity):
	streams: 4, words: 87
xmvhdl_cg: Memory Usage - Current physical: 19.7M, Current virtual: 33.3M, Peak physical: 19.7M
xmvhdl: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.0s, 37.2% cpu)
/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_gene/a1/vhdl.vhd:
	errors: 0, warnings: 0
xmvhdl_p: Memory Usage - Current physical: 20.8M, Current virtual: 38.3M, Peak physical: 20.8M
\SAR\.DIGITAL_GENE:A1 (architecture):
	streams: 1, words: 209
xmvhdl_cg: Memory Usage - Current physical: 19.8M, Current virtual: 33.4M, Peak physical: 19.8M
xmvhdl: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.0s, 86.9% cpu)
/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_part/entity/vhdl.vhd:
	errors: 0, warnings: 0
xmvhdl_p: Memory Usage - Current physical: 20.6M, Current virtual: 38.2M, Peak physical: 20.6M
\SAR\.DIGITAL_PART (entity):
	streams: 24, words: 1539
xmvhdl_cg: Memory Usage - Current physical: 19.8M, Current virtual: 33.3M, Peak physical: 19.8M
xmvhdl: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.0s, 84.1% cpu)
/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_part/a3/vhdl.vhd:
	errors: 0, warnings: 0
xmvhdl_p: Memory Usage - Current physical: 20.9M, Current virtual: 38.3M, Peak physical: 20.9M
\SAR\.DIGITAL_PART:A3 (architecture):
	streams: 1, words: 692
xmvhdl_cg: Memory Usage - Current physical: 20.0M, Current virtual: 33.4M, Peak physical: 20.0M
xmvhdl: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.0s, 85.5% cpu)
file: /usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/ConnRules_inhconn_full_fast_gnd.vams
	connect worklib.ConnRules_inhconn_full_fast_gnd:vams
		errors: 0, warnings: 0
file: /usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/L2E_2_inhconn_gnd.vams
	module worklib.L2E_2_inhconn_gnd:vams
		errors: 0, warnings: 0
file: /usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/E2L_2_inhconn_gnd.vams
	module worklib.E2L_2_inhconn_gnd:vams
		errors: 0, warnings: 0
file: /usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/Bidir_2_inhconn_gnd.vams
	module worklib.Bidir_2_inhconn_gnd:vams
		errors: 0, warnings: 0
file: ./netlist.vams
	module SAR.switch:schematic
		errors: 0, warnings: 0
	module SAR.switch2:schematic
		errors: 0, warnings: 0
	module SAR.sar8:schematic
		errors: 0, warnings: 0
	module SAR.test_sar8:schematic
		errors: 0, warnings: 0
file: ./cds_globals.vams
	module worklib.cds_globals:vams
		errors: 0, warnings: 0
file: /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/voltage_gene/verilogams/verilog.vams
	module SAR.voltage_gene:verilogams
		errors: 0, warnings: 0
file: /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/save_es/verilogams/verilog.vams
	module SAR.save_es:verilogams
		errors: 0, warnings: 0
file: /usr/local/XFAB/xh018/diglibs/D_CELLS_3V/v2_1/cadence_IC61/v2_1_1_1/D_CELLS_3V/NA2_3VX1/verilogams/verilog.vams
	module D_CELLS_3V.NA2_3VX1:verilogams
		errors: 0, warnings: 0
file: /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/switched_comparator/verilogams/verilog.vams
	module SAR.switched_comparator:verilogams
		errors: 0, warnings: 0
file: /usr/local/XFAB/xh018/diglibs/D_CELLS_3V/v2_1/cadence_IC61/v2_1_1_1/D_CELLS_3V/IN_3VX4/verilogams/verilog.vams
	module D_CELLS_3V.IN_3VX4:verilogams
		errors: 0, warnings: 0
xmvlog: *W,SPDUSD: Include directory /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/ given but not used.
	Total errors/warnings found outside modules and primitives:
		errors: 0, warnings: 1
xmvlog: Memory Usage - Current physical: 28.2M, Current virtual: 53.7M, Peak physical: 28.2M
xmvlog: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.0s, 73.7% cpu)
AMSD Universal Connect Module UCM is enabled.
		Caching library 'D_CELLS_3V' ....... Done
		Caching library 'SAR' ....... Done
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
xmelab: *N,MSFLON: Xcelium will initiate mixed signal elaboration, Reason: .amsbind.scs.
	Top level design units:
		test_sar8
		cds_globals
	Discipline resolution Pass...
connectmodule L2E_2_inhconn_gnd(Din,Aout);
                              |
xmelab: *W,CMNSIE (/usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/L2E_2_inhconn_gnd.vams,54|30): Connect module with electrical is running in non-AMS-SIE mode because the indicated connect module L2E_2_inhconn_gnd does not support SIE. To enable AMS-SIE mode on connect module with electrical, either switch to SIE compatible built-in connect modules, or update the indicated user-defined connect module to support SIE mode.
	Doing auto-insertion of connection elements...
	Connect Rules applied are:
		ConnRules_inhconn_full_fast_gnd
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		SAR.voltage_gene:verilogams <0x6125e0b3>
			streams:   2, words:   423
		SAR.save_es:verilogams <0x28e114b7>
			streams:   2, words:  2095
		SAR.switched_comparator:verilogams <0x10727109>
			streams:   3, words:  1722
		SAR.sar8:schematic <0x11a7f874>
			streams:   0, words:     0
		SAR.switch:schematic <0x40e760c2>
			streams:   0, words:     0
		SAR.switch:schematic <0x20bbd589>
			streams:   0, words:     0
		SAR.switch:schematic <0x242361bf>
			streams:   0, words:     0
		worklib.L2E_2_inhconn_gnd:vams <0x36df03c9>
			streams:   3, words:  1401
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
	VHDL Design hierarchy:
		Components:              2       2
		Processes:              13      13
		Signals:                 9       9
	Verilog Design hierarchy:
		Modules:                62      13
		Primitives:              3       2
		Timing outputs:          3       3
		Registers:             137      29
		Scalar wires:           27       -
		Always blocks:          26      16
		Initial blocks:         25       6
		Cont. assignments:      22       3
		Interconnect:           90       -
		Process Clocks:          3       2
		Simulation timescale:  1ps
	Writing initial simulation snapshot: SAR.test_sar8:config
xmelab: Memory Usage - Final: 79.0M, Peak: 249.4M, Peak virtual: 331.0M
xmelab: CPU Usage - 0.1s system + 0.1s user = 0.1s total (0.1s, 81.0% cpu)
Loading snapshot SAR.test_sar8:config .................... Done
Simulating in non-AMS-SIE mode...
	Starting analog simulation engine...
AMSD Flexible Release Matrix --- using Spectre from installation:
    /usr/local/cadence/spectre/tools/bin/spectre
AMSD: Using spectre solver with arguments: -ahdllibdir xcelium.d/AMSD/ahdlSimDB +aps.
xcelium> source /usr/local/cadence/xcelium/tools/xcelium/files/xmsimrc
xcelium> source /usr/local/cadence/xcelium/tools/xcelium/files/amsrc
xcelium> 
xcelium> # This is the NC-SIM(R) probe command file
xcelium> # used in the AMS-ADE integration.
xcelium> 
xcelium> 
xcelium> #
xcelium> # Database settings
xcelium> #
xcelium> if { [info exists ::env(AMS_RESULTS_DIR) ] } { set AMS_RESULTS_DIR $env(AMS_RESULTS_DIR)} else {set AMS_RESULTS_DIR "../psf"}
../psf
xcelium> database -open ams_database -into ${AMS_RESULTS_DIR} -default
Created default SHM database ams_database
xcelium> 
xcelium> #
xcelium> # Probe settings
xcelium> #
xcelium> probe -create -emptyok -database ams_database {test_sar8.Analog_in}
Created probe 1
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.clk_bar}
Created probe 2
xcelium> probe -create -emptyok -database ams_database {test_sar8.clock}
Created probe 3
xcelium> probe -create -emptyok -database ams_database {test_sar8.start}
Created probe 4
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.comp}
Created probe 5
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[7]}
Created probe 6
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[6]}
Created probe 7
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[5]}
Created probe 8
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[4]}
Created probe 9
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[3]}
Created probe 10
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[2]}
Created probe 11
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[1]}
Created probe 12
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[0]}
Created probe 13
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.outn}
Created probe 14
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.outp}
Created probe 15
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.VA}
Created probe 16
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.VB}
Created probe 17
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.SAp}
Created probe 18
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Vref2}
Created probe 19
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.SBp}
Created probe 20
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.stateCompare}
Created probe 21
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.stateHold}
Created probe 22
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.stateSample}
Created probe 23
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sp[8]}
Created probe 24
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sp[7]}
Created probe 25
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sp[6]}
Created probe 26
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sp[5]}
Created probe 27
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sp[4]}
Created probe 28
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sp[3]}
Created probe 29
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sp[2]}
Created probe 30
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sp[1]}
Created probe 31
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sp[0]}
Created probe 32
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.partialResultFlag[7]}
Created probe 33
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.partialResultFlag[6]}
Created probe 34
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.partialResultFlag[5]}
Created probe 35
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.partialResultFlag[4]}
Created probe 36
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.partialResultFlag[3]}
Created probe 37
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.partialResultFlag[2]}
Created probe 38
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.partialResultFlag[1]}
Created probe 39
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.partialResultFlag[0]}
Created probe 40
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.debugFlag}
Created probe 41
xcelium> 
xcelium> run

Spectre (R) Circuit Simulator
Version 23.1.0.802.isr17 64bit -- 10 Apr 2025
Copyright (C) 1989-2025 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence and Spectre are registered trademarks of Cadence Design Systems, Inc. All others are the property of their respective holders.

Includes RSA BSAFE(R) Cryptographic or Security Protocol Software from RSA Security, Inc.

User: ics15   Host: pantin   HostID: C38A0F02   PID: 117852
Memory  available: 28.2503 GB  physical: 33.0494 GB
Linux   : Rocky Linux release 9.7 (Blue Onyx)
CPU Type: Intel(R) Core(TM) i9-14900
        Socket: Processors [Frequency] (Hyperthreaded Processor)
        0:       0 [5500.0] (  1 ),  1 [2206.7] (),  2 [2790.3] (  3 )
                 3 [800.0] (),  4 [2429.4] (  5 ),  5 [800.0] (),  6 [801.4] (  7 )
                 7 [800.0] (),  8 [800.0] (  9 ),  9 [800.0] (), 10 [800.0] ( 11 )
                11 [800.0] (), 12 [800.0] ( 13 ), 13 [800.0] (), 14 [923.3] ( 15 )
                15 [800.0] (), 16 [800.0] (), 17 [802.0] (), 18 [800.0] (), 19 [800.0] ()
                20 [800.0] (), 21 [4299.9] (), 22 [4142.4] (), 23 [800.0] (), 24 [3327.0] ()
                25 [1252.3] (), 26 [3159.5] (), 27 [4158.5] (), 28 [800.0] (), 29 [800.0] ()
                30 [807.4] (), 31 [800.0] ()
        
System load averages (1min, 5min, 15min) : 0.3 %, 0.5 %, 0.5 %
Hyperthreading is enabled
HPC is enabled


Simulating `spiceModels.ams' on pantin at 5:24:57 PM, Tue Feb 24, 2026 (process id: 117852).
Current working directory: /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist
Command line:
    /usr/local/cadence/spectre/tools/bin/spectre -64 spiceModels.ams  \
        +config  \
        /usr/local/cadence/spectre/tools.lnx86/spectre/etc/configs/ams.cfg  \
        -ahdllibdir xcelium.d/AMSD/ahdlSimDB +aps -raw ../psf  \
        -I/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/  \
        +ams_control=xcelium.d/AMSD/ams_ctrl/ams_ctrl_117554_pantin
Spectre Licensing Information:
Spectre [17:24:57.090577] Configured Lic search path (22.01-s002): 30000@cadence.cnfm.fr

Spectre Licensing Information:
Spectre [17:24:58.358666] Periodic Lic check successful

Loading /usr/local/cadence/spectre/tools.lnx86/cmi/lib/64bit/5.0/libinfineon_sh.so ...
Loading /usr/local/cadence/spectre/tools.lnx86/cmi/lib/64bit/5.0/libphilips_I_sh.so ...
Loading /usr/local/cadence/spectre/tools.lnx86/cmi/lib/64bit/5.0/libphilips_sh.so ...
Loading /usr/local/cadence/spectre/tools.lnx86/cmi/lib/64bit/5.0/libsparam_sh.so ...
Loading /usr/local/cadence/spectre/tools.lnx86/cmi/lib/64bit/5.0/libstmodels_sh.so ...
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/spiceModels.ams

Notice from spectre during circuit read-in.
    Configuration file used: `/usr/local/cadence/spectre/tools.lnx86/spectre/etc/configs/ams.cfg'.

Reading link:  /usr/local/cadence/spectre
Reading file:  /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/configs/spectre.cfg
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/xcelium.d/AMSD/ahdlSimDB/SAR__switched_comparator__verilogams__0x10000001_behavioral.va
Reading file:  /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/ahdl/constants.vams
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/xcelium.d/AMSD/ahdlSimDB/worklib__L2E_2_inhconn_gnd__vams__0x10000001_behavioral.va
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/xcelium.d/AMSD/ahdlSimDB/SAR__save_es__verilogams__0x10000001_behavioral.va
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/xcelium.d/AMSD/ahdlSimDB/SAR__voltage_gene__verilogams__0x10000001_behavioral.va
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/spiceModels.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/config.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/param.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/bip.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/tm_bip.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpva.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpva3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvb3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvc3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnva.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvba.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvbb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvca.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvcb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvhscr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvascr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvhbscr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pe.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pf.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pe.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pf.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pe.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pf.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/cap.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/tm_cap.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csandwt3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csandwt4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csandwt5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf2p.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf3p.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf3a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf4a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf5a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft4a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft5a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft6a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cif3a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cif4a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cif5a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cift4a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cift5a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cift6a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm4t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm5t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm6t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmm4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmm4t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmm5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmm5t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh4t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh5t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh6t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmmh4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmmh4t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmmh5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmmh5t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc_pmos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvci.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvci_nmos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvci_m.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3_pmos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3i_nmos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3i_m.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpod.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpod_i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpodhv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpodhv_i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cp1sub.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cp1suba.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cp1subp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/p_cap.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/tag_25v.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/tag_60v.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/dio.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/tm_dio.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnn3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dp3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnw3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddnwmv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdnwmv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dipdnwmv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddnwa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dipdnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnhpw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnhpwa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dphnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dphnwa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dhpw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dhnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dndf.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdwhn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dwhn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpwhn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpndf.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdddnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddpldnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn3dpl.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dbn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpol.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnpdd_scr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdd_scr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dsb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dsba.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dsba_qp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnp20.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpp20.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn3sci.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dscidnwmv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/mos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/tm_mos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei_a_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei_a_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nel.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/neli.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/neli_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/neli_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pel.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pel_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/peli.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/peli_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/peli_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nn3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i_a_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i_a_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3ln.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3ln_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lni.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lni_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lni_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3_mos1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_mos1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelna.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelnai.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelnai_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelnai_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lna.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lnai.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lnai_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lnai_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lna.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lna_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lnai.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lnai_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lnai_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/jf_nmma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmma_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/jf_pmma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmma_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedi.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedi_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedia.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedia_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped2_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhv_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhv_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhv_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhv_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmc_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmc_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmd_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmd_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmc_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmc_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nma_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phv_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phv_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phhv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phhv_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phhv_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmc_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmc_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmmc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmmc_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmmc_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pma_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvti.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvti_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvti_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvt_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvti.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvti_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvti_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhvd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhvd_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhvd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhvd_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/photo.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/tm_pho.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dpho.va
Reading link:  /usr/local/cadence/spectre/tools.lnx86/spectre/etc/ahdl/discipline.h
Reading file:  /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/ahdl/disciplines.vams
Reading link:  /usr/local/cadence/spectre/tools.lnx86/spectre/etc/ahdl/constants.h
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphob.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/iphoto_uv.va
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc_cat.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc0_cat.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphocfp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphocfp_cat.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod_an1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod_an2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod0_an1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod0_an2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphodfp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphodfp_an1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphodfp_an2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspada0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/ispad.va
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/iphoto_apd_trig.va
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb_jun.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb_trig.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb0_jun.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/ispad_trig.va
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb_jun.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb_trig.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb0_jun.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspbfep.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapda.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/iphoto_apd.va
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapda_cat.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapda0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspada.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspada_cat.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/res.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/tm_res.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn_esd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp_io.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp_esd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw_scr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn3s.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw3_scr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdnwmv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1_3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1_3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1s.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1s_3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1h.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1h_3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1k1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1k1_3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rctdn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rctdp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rctp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsildn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsildp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsilnp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsilpp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdn3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdp3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbnp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbpp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbpp1k1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rmtp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rmtpl.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/pfuse.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/s_res.scs
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/amsControlSpectre.scs
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/.amsbind.scs
Reading file:  /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/configs/ams.cfg
Time for NDB Parsing: CPU = 117.814 ms, elapsed = 523.683 ms.
Time accumulated: CPU = 150.433 ms, elapsed = 523.684 ms.
Peak resident memory used = 196 Mbytes.

Created directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB/ (775)
Created directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB//e6d6445b6f20c83e9993c59257575fe8.worklib__L2E_2_inhconn_gnd__vams__0x10000001_behavioral.ahdlcmi/ (775)
Created directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB//e6d6445b6f20c83e9993c59257575fe8.worklib__L2E_2_inhconn_gnd__vams__0x10000001_behavioral.ahdlcmi/Linux-64/ (775)
Compiling ahdlcmi module library for worklib__L2E_2_inhconn_gnd__vams__0x10000001_behavioral.
Finished compilation in 432 ms (elapsed) for worklib__L2E_2_inhconn_gnd__vams__0x10000001_behavioral.
Installed compiled interface for worklib__L2E_2_inhconn_gnd__vams__0x10000001_behavioral.
Opening directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB/ (775)
Created directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB//6f3ec76cbe5796664cb80f87ce0493b0.SAR__switched_comparator__verilogams__0x10000001_behavioral.ahdlcmi/ (775)
Created directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB//6f3ec76cbe5796664cb80f87ce0493b0.SAR__switched_comparator__verilogams__0x10000001_behavioral.ahdlcmi/Linux-64/ (775)
Compiling ahdlcmi module library for SAR__switched_comparator__verilogams__0x10000001_behavioral.
Finished compilation in 340 ms (elapsed) for SAR__switched_comparator__verilogams__0x10000001_behavioral.
Installed compiled interface for SAR__switched_comparator__verilogams__0x10000001_behavioral.
Opening directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB/ (775)
Created directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB//77765d6990334684b16dabf5bd7b5df0.SAR__save_es__verilogams__0x10000001_behavioral.ahdlcmi/ (775)
Created directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB//77765d6990334684b16dabf5bd7b5df0.SAR__save_es__verilogams__0x10000001_behavioral.ahdlcmi/Linux-64/ (775)
Compiling ahdlcmi module library for SAR__save_es__verilogams__0x10000001_behavioral.
Finished compilation in 326 ms (elapsed) for SAR__save_es__verilogams__0x10000001_behavioral.
Installed compiled interface for SAR__save_es__verilogams__0x10000001_behavioral.
Opening directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB/ (775)
Created directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB//221671a9ca94000ade0c993e48f446fe.SAR__voltage_gene__verilogams__0x10000001_behavioral.ahdlcmi/ (775)
Created directory xcelium.d/AMSD/ahdlSimDB/spiceModels.ahdlSimDB//221671a9ca94000ade0c993e48f446fe.SAR__voltage_gene__verilogams__0x10000001_behavioral.ahdlcmi/Linux-64/ (775)
Compiling ahdlcmi module library for SAR__voltage_gene__verilogams__0x10000001_behavioral.
Finished compilation in 350 ms (elapsed) for SAR__voltage_gene__verilogams__0x10000001_behavioral.
Installed compiled interface for SAR__voltage_gene__verilogams__0x10000001_behavioral.
Time for Elaboration: CPU = 26.781 ms, elapsed = 1.47446 s.
Time accumulated: CPU = 177.243 ms, elapsed = 1.99817 s.
Peak resident memory used = 212 Mbytes.


Notice from spectre during hierarchy flattening.
    The value 'psf' specified for the 'checklimitdest' option will no longer be supported in future releases. Use 'spectre -h' to see other recommended values for the 'checklimitdest' option.



Warning from spectre during hierarchy flattening.
    WARNING (SPECTRE-8527): There are some nodes and instances removed from the netlist topology check. Check the circuit and correct the topology. Or use preserve_inst to keep them if necessary.

***********************************************
  Total removed instances 1 ( dangling 1, terminals connected together 0)  

Warning from spectre during hierarchy flattening.
    WARNING (SPECTRE-8529): Dangling instance. test_sar8.I19.V5 is removed.


  Total removed nodes 1 ( dangling nodes 1, floating nodes 0 )

Warning from spectre during hierarchy flattening.
    WARNING (SPECTRE-8530): Dangling node. test_sar8.I19.Vcm is removed.
    WARNING (SPECTRE-8531): Floating node. test_sar8.I19___dUmmY_pORt_1_ is removed.
    WARNING (SPECTRE-8531): Floating node. test_sar8.I19___dUmmY_pORt_2_ is removed.
    WARNING (SPECTRE-8531): Floating node. test_sar8.I19___dUmmY_pORt_3_ is removed.

***********************************************
Time for EDB Visiting: CPU = 1.445 ms, elapsed = 1.44982 ms.
Time accumulated: CPU = 178.732 ms, elapsed = 1.99967 s.
Peak resident memory used = 213 Mbytes.


Notice from spectre during topology check.
    No connections to node `test_sar8.I19___dUmmY_pORt_0_'.
    Only one connection to node `vdd3!'.
    No DC path from node `test_sar8.I19___dUmmY_pORt_0_' to ground, Gmin installed to provide path.
Notice from spectre during initial setup.
    Multithreading is disabled due to the size of the design being too small.


Netlist title:
        //


Global user options:
         psfversion = 1.4.0
               temp = 27
            vabstol = 1e-06
            iabstol = 1e-12
           homotopy = 5
              limit = delta
               gmin = 1e-12
             rforce = 1
           maxnotes = 5
           maxwarns = 5
             digits = 5
             pivrel = 0.001
     checklimitdest = psf
      ignorezerovar = yes
       saveahdlvars = all
               save = selected
               tnom = 27
              scale = 1
             scalem = 1
             reltol = 0.001

Scoped user options:

Circuit inventory:
              nodes 96
            bsim3v3 42    
          capacitor 9     
SAR__save_es__verilogams__0x10000001_behavioral 1     
SAR__switched_comparator__verilogams__0x10000001_behavioral 1     
SAR__voltage_gene__verilogams__0x10000001_behavioral 1     
               vcvs 1     
            vsource 4     
worklib__L2E_2_inhconn_gnd__vams__0x10000001_behavioral 22    

Analysis and control statement inventory:
               info 7     
               tran 1     

Output statements:
             .probe 0     
           .measure 0     
               save 15    


Notice from spectre during initial setup.
    APS enabled.

Time for parsing: CPU = 1.038 ms, elapsed = 7.31015 ms.
Time accumulated: CPU = 179.821 ms, elapsed = 2.00703 s.
Peak resident memory used = 216 Mbytes.

~~~~~~~~~~~~~~~~~~~~~~
Pre-Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~
   -   (APS) Multi-threading. The recommended number of threads is 1, consider adding +mt=1 on command line.
~~~~~~~~~~~~~~~~~~~~~~

***********************************************
Transient Analysis `tran': time = (0 s -> 5 ms)
***********************************************
Convergence achieved in 25 iterations.
DC simulation time: CPU = 1.382 ms, elapsed = 2.35391 ms.

Opening the PSFXL file ../psf/tran.tran.tran ...
Important parameter values:
    start = 0 s
    outputstart = 0 s
    stop = 5 ms
    step = 5 us
    maxstep = 50 us
    ic = all
    useprevic = no
    skipdc = no
    reltol = 100e-06
    abstol(V) = 1 uV
    abstol(I) = 1 pA
    temp = 27 C
    tnom = 27 C
    tempeffects = all
    errpreset = conservative
    method = gear2only
    lteratio = 10
    relref = alllocal
    cmin = 0 F
    gmin = 1 pS
    rabsshort = 1 mOhm


Notice from spectre during transient analysis `tran'.
    Multithreading is disabled due to the size of the design being too small.


Output and IC/nodeset summary:
                 save   15      (voltage)
                 save   88      (unitless)


Warning from spectre at time = 800 ns during transient analysis `tran'.
    WARNING (SPECTRE-16780): LTE tolerance was temporarily relaxed to step over a discontinuity in the signal: test_sar8.Analog_in. Check the design or use '+diagnose' to get more information.
    WARNING (SPECTRE-16881): Detected possible convergence difficulties which might be related to Verilog-A models. Use the command-line option '-ahdllint=warn' to check the Verilog-A modeling issues.
Warning from spectre at time = 10.8 us during transient analysis `tran'.
    WARNING (SPECTRE-16780): LTE tolerance was temporarily relaxed to step over a discontinuity in the signal: test_sar8.Analog_in. Check the design or use '+diagnose' to get more information.
    WARNING (SPECTRE-16881): Detected possible convergence difficulties which might be related to Verilog-A models. Use the command-line option '-ahdllint=warn' to check the Verilog-A modeling issues.
Warning from spectre at time = 20.8 us during transient analysis `tran'.
    WARNING (SPECTRE-16780): LTE tolerance was temporarily relaxed to step over a discontinuity in the signal: test_sar8.Analog_in. Check the design or use '+diagnose' to get more information.
    WARNING (SPECTRE-16881): Detected possible convergence difficulties which might be related to Verilog-A models. Use the command-line option '-ahdllint=warn' to check the Verilog-A modeling issues.

    tran: time = 125.1 us     (2.5 %), step = 298 ns      (5.96 m%)
    tran: time = 375.1 us     (7.5 %), step = 298 ns      (5.96 m%)
    tran: time = 625.2 us    (12.5 %), step = 334.8 ns     (6.7 m%)
    tran: time = 800.5 us      (16 %), step = 426.4 ps    (8.53 u%)
    tran: time = 875.4 us    (17.5 %), step = 413.5 ns    (8.27 m%)
    tran: time = 1.125 ms    (22.5 %), step = 413.5 ns    (8.27 m%)
    tran: time = 1.375 ms    (27.5 %), step = 413.5 ns    (8.27 m%)
    tran: time = 1.625 ms    (32.5 %), step = 413.5 ns    (8.27 m%)
    tran: time = 1.875 ms    (37.5 %), step = 250.3 ns    (5.01 m%)
    tran: time = 2.125 ms    (42.5 %), step = 250.4 ns    (5.01 m%)
    tran: time = 2.375 ms    (47.5 %), step = 250.4 ns    (5.01 m%)
    tran: time = 2.625 ms    (52.5 %), step = 351.7 ns    (7.03 m%)
    tran: time = 2.875 ms    (57.5 %), step = 351.7 ns    (7.03 m%)
    tran: time = 3.125 ms    (62.5 %), step = 351.7 ns    (7.03 m%)
    tran: time = 3.375 ms    (67.5 %), step = 357.3 ns    (7.15 m%)
    tran: time = 3.625 ms    (72.5 %), step = 398.6 ns    (7.97 m%)
    tran: time = 3.875 ms    (77.5 %), step = 477.1 ns    (9.54 m%)
    tran: time = 4.125 ms    (82.5 %), step = 266.7 ns    (5.33 m%)
    tran: time = 4.375 ms    (87.5 %), step = 319.5 ns    (6.39 m%)
    tran: time = 4.625 ms    (92.5 %), step = 336.4 ns    (6.73 m%)

Warning from spectre at time = 4.7108 ms during transient analysis `tran'.
    WARNING (CMI-2139): test_sar8.I19.SB.I0.M1.m1: The bulk-drain junction current exceeds `imelt'.  The results computed by Spectre may be inaccurate because the junction current model has been linearized.
Warning from spectre at time = 4.82083 ms during transient analysis `tran'.
    WARNING (CMI-2144): test_sar8.I19.SB.I0.M1.m1: The bulk-drain junction current exceeds `imax'.

    tran: time = 4.875 ms    (97.5 %), step = 301.7 ns    (6.03 m%)

The analog simulator has reached stop time, please use `analog -stop <new stop time>' to extend the analog stop time.
Simulation stopped via transient analysis stoptime at time 5 MS
Memory Usage - Current physical: 103.5M, Current virtual: 337.5M, Peak physical: 103.5M
CPU Usage - 0.2s system + 0.1s user = 0.4s total (1.9% cpu)
xcelium> exit
Number of accepted tran steps =             329934

Maximum value achieved for any signal of each quantity: 
V: V(test_sar8.Analog_in) = 5 V
I: I(test_sar8.I17._cds_internal_voltage_gene_:vout_p_vout_n_flow) = 697 mA
Maximum value of each quantity, excluding Verilog-A modules or dangling current sources:
V: V(test_sar8.I19.VB) = 4.264 V
I: I(test_sar8.I17._cds_internal_voltage_gene_:vout_p_vout_n_flow) = 697 mA

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Post-Transient Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
   -   To further speed up simulation, consider
          add ++aps on command line
   -   Non-default settings that could significantly slow down simulation
          errpreset = conservative, default moderate
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~


During simulation, the CPU load for active processors is :
         0 (50.9 %)      1 (17.9 %)      2 (27.8 %)      4 (11.5 %)
         6 (10.4 %)      8 (10.8 %)     10 (10.1 %)     12 (10.4 %)
        14 (9.9 %)      16 (1.0 %)      17 (8.8 %)      21 (1.1 %)
        Total: 176.1%
Initial condition solution time: CPU = 1.394 ms, elapsed = 2.36607 ms.
Intrinsic tran analysis time:    CPU = 31.2876 s, elapsed = 17.5746 s.

**** AMSD: Mixed-Signal Activity Statistics ****
Number of A-to-D events:                       0
  Number of A-to-D events in IEs:              0
Number of D-to-A events:                   25195
  Number of D-to-A events in IEs:          24695
Number of VHDL-AMS Breaks:                     0
Number of direct digital accesses:             518

**** AMSD: IE Additional Activity Statistics ****
                                          Detected IEs,    Reporting IEs / Total IEs
Number of IEs with D-to-A X edge:                    0,    0/22
Number of IEs with D-to-A Z edge:                    0,    0/22
Number of IEs with A-to-D X edge:                    0,    0/22
Number of IEs with A-to-D Z edge:                    0,    0/22
List of IEs with max number of D-to-A edges:         1,    0/22
   test_sar8.I19.\Sm[8]__L2E_2_inhconn_gnd__logic     (0)
List of IEs with max number of A-to-D edges:         1,    0/22
   test_sar8.I19.\Sm[8]__L2E_2_inhconn_gnd__logic     (0)
Number of IEs with narrow/lost D-to-A pulses:        0
List of IEs with max narrow/lost D-to-A pulses:      1,    0/22
   test_sar8.I19.\Sm[8]__L2E_2_inhconn_gnd__logic     (0)
List of IEs with Vin exceeded limit:                 0,    0/22
List of IEs with Vdd exceeded limit:                 0,    0/22
List of IEs with port current reached ilimit:        0,    0/22

Total time required for tran analysis `tran': CPU = 31.29 s, elapsed = 17.578 s, util. = 178%.
Time accumulated: CPU = 31.4961 s, elapsed = 24.6329 s.
Peak resident memory used = 580 Mbytes.

finalTimeOP: writing operating point information to rawfile.

Opening the PSF file ../psf/finalTimeOP.info ...
modelParameter: writing model parameter values to rawfile.

Opening the PSF file ../psf/modelParameter.info ...
element: writing instance parameter values to rawfile.

Opening the PSF file ../psf/element.info ...
outputParameter: writing output parameter values to rawfile.

Opening the PSF file ../psf/outputParameter.info ...
designParamVals: writing netlist parameters to rawfile.

Opening the PSFASCII file ../psf/designParamVals.info ...
primitives: writing primitives to rawfile.

Opening the PSFASCII file ../psf/primitives.info.primitives ...
subckts: writing subcircuits to rawfile.

Opening the PSFASCII file ../psf/subckts.info.subckts ...
AMSD: Time accumulated for digital engine, elapsed = 274.614 ms.
Spectre Licensing Information:
Spectre Lic Summary:
[17:25:22.079784] Cdslmd servers:30000@cadence.cnfm.fr
[17:25:22.079794] Feature usage summary:
[17:25:22.079794] Virtuoso_Multi_mode_Simulation
[17:25:22.079794] Spectre_AMS_MMSIM_Lk


Aggregate audit (5:25:22 PM, Tue Feb 24, 2026):
Time used: CPU = 31.5 s, elapsed = 24.7 s, util. = 128%.
Time spent in licensing: elapsed = 399 ms.
Peak memory used = 578 Mbytes.
Simulation started at: 5:24:57 PM, Tue Feb 24, 2026, ended at: 5:25:22 PM, Tue Feb 24, 2026, with elapsed time (wall clock): 24.7 s.
spectre completes with 0 errors, 14 warnings, and 9 notices.
Total License Acquisition Time : 0.399 s.
  xmsim  : License Acquisition Time -- 6e-06 s.
  spectre: License Acquisition Time -- 0.399 s.
xmsim: Memory Usage - Final: 95.6M, Peak: 103.9M, Peak virtual: 401.5M
xmsim: CPU Usage - 1.6s system + 32.6s user = 34.2s total (25.6s, 100.0% cpu)
TOOL:	xrun(64)	24.09-s011: Exiting on Feb 24, 2026 at 17:25:22 CET  (total: 00:00:33)
