xrun(64): 24.09-s011: (c) Copyright 1995-2025 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.09-s011: Started on Jan 28, 2026 at 11:18:13 CET
xrun
	-f xrunArgs
		-clean
		-UNBUFFERED
		-cdslib ./cds.lib
		-errormax 50
		-status
		-nowarn DLNOHV
		-nowarn DLCLAP
		-v93
		-incdir /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/
		-ade
		-timescale 1ns/1ns
		-vtimescale 1ns/1ns
		-discipline logic
		-delay_mode None
		-novitalaccl
		-access r
		-noparamerr
		-amspartinfo ../psf/partition.info
		-rnm_partinfo
		-modelincdir /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/
		./spiceModels.scs
		./amsControlSpectre.scs
		-input ./probe.tcl
		-run
		-exit
		-xmsimargs "+amsrawdir ../psf"
		-simcompatible_ams spectre
		-name SAR.test_switch:config
		-amsconnrules ConnRules_inhconn_full_fast_gnd
		+define+CDS_SELECT_CRS
		+define+CONNRULES_INHCONN_FULL_FAST_GND
		/usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/ConnRules_inhconn_full_fast_gnd.vams
		/usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/L2E_2_inhconn_gnd.vams
		/usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/E2L_2_inhconn_gnd.vams
		/usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/Bidir_2_inhconn_gnd.vams
		-allowredefinition
		-amsbind
		-top SAR.test_switch:schematic
		-top cds_globals
		./netlist.vams
		-f ./textInputs
			-makelib SAR
			-endlib
		./cds_globals.vams
		-l ../psf/xrun.log
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
file: /usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/ConnRules_inhconn_full_fast_gnd.vams
	connect worklib.ConnRules_inhconn_full_fast_gnd:vams
		errors: 0, warnings: 0
file: /usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/L2E_2_inhconn_gnd.vams
	module worklib.L2E_2_inhconn_gnd:vams
		errors: 0, warnings: 0
file: /usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/E2L_2_inhconn_gnd.vams
	module worklib.E2L_2_inhconn_gnd:vams
		errors: 0, warnings: 0
file: /usr/local/XFAB/x_all/diglibs/xfab_connectLib/v1_0/cadence_IC61/v1_0_1/xfab_connectLib/Bidir_2_inhconn_gnd.vams
	module worklib.Bidir_2_inhconn_gnd:vams
		errors: 0, warnings: 0
file: ./netlist.vams
	module SAR.test_switch:schematic
		errors: 0, warnings: 0
file: ./cds_globals.vams
	module worklib.cds_globals:vams
		errors: 0, warnings: 0
xmvlog: *W,SPDUSD: Include directory /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/ given but not used.
	Total errors/warnings found outside modules and primitives:
		errors: 0, warnings: 1
xmvlog: Memory Usage - Current physical: 27.1M, Current virtual: 53.4M, Peak physical: 27.1M
xmvlog: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.0s, 57.2% cpu)
AMSD Universal Connect Module UCM is enabled.
		Caching library 'SAR' ....... Done
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
xmelab: *N,MSFLON: Xcelium will initiate mixed signal elaboration, Reason: .amsbind.scs.
	Top level design units:
		test_switch
		cds_globals
	Discipline resolution Pass...
	Building instance overlay tables: .................... Done
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       5
		Registers:               0      24
		Always blocks:           0      12
		Initial blocks:          0       3
		Cont. assignments:       0       3
		Interconnect:            6       -
		Simulation timescale:  1ps
	Writing initial simulation snapshot: SAR.test_switch:config
xmelab: Memory Usage - Final: 72.8M, Peak: 193.0M, Peak virtual: 277.2M
xmelab: CPU Usage - 0.0s system + 0.0s user = 0.1s total (0.1s, 100.0% cpu)
Loading snapshot SAR.test_switch:config .................... Done
	Starting analog simulation engine...
AMSD Flexible Release Matrix --- using Spectre from installation:
    /usr/local/cadence/spectre/tools/bin/spectre
AMSD: Using spectre solver with arguments: -ahdllibdir xcelium.d/AMSD/ahdlSimDB.
xcelium> source /usr/local/cadence/xcelium/tools/xcelium/files/xmsimrc
xcelium> source /usr/local/cadence/xcelium/tools/xcelium/files/amsrc
xcelium> 
xcelium> # This is the NC-SIM(R) probe command file
xcelium> # used in the AMS-ADE integration.
xcelium> 
xcelium> 
xcelium> #
xcelium> # Database settings
xcelium> #
xcelium> if { [info exists ::env(AMS_RESULTS_DIR) ] } { set AMS_RESULTS_DIR $env(AMS_RESULTS_DIR)} else {set AMS_RESULTS_DIR "../psf"}
../psf
xcelium> database -open ams_database -into ${AMS_RESULTS_DIR} -default
Created default SHM database ams_database
xcelium> 
xcelium> #
xcelium> # Probe settings
xcelium> #
xcelium> probe -create -emptyok -database ams_database -all -depth all {test_switch}
Created probe 1
xcelium> probe -create -emptyok -database ams_database -all cds_globals
Created probe 2
xcelium> probe -create -emptyok -database ams_database {test_switch.R}
Created probe 3
xcelium> probe -create -emptyok -database ams_database {cds_globals.\gnd! }
Created probe 4
xcelium> probe -create -emptyok -database ams_database {test_switch.net6}
Created probe 5
xcelium> probe -create -emptyok -database ams_database {test_switch.net3}
Created probe 6
xcelium> probe -create -emptyok -database ams_database -flow -ports -index -depth all {test_switch}
Created probe 7
xcelium> probe -create -emptyok -database ams_database -aicms -all {test_switch}
Created probe 8
xcelium> 
xcelium> run

Spectre (R) Circuit Simulator
Version 23.1.0.802.isr17 64bit -- 10 Apr 2025
Copyright (C) 1989-2025 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence and Spectre are registered trademarks of Cadence Design Systems, Inc. All others are the property of their respective holders.

Includes RSA BSAFE(R) Cryptographic or Security Protocol Software from RSA Security, Inc.

User: ics15   Host: pantin   HostID: C38A0F02   PID: 860610
Memory  available: 27.9157 GB  physical: 33.0497 GB
Linux   : Rocky Linux release 9.6 (Blue Onyx)
CPU Type: Intel(R) Core(TM) i9-14900
        Socket: Processors [Frequency] (Hyperthreaded Processor)
        0:       0 [5010.9] (  1 ),  1 [989.0] (),  2 [800.0] (  3 )
                 3 [800.0] (),  4 [800.7] (  5 ),  5 [800.0] (),  6 [800.0] (  7 )
                 7 [800.0] (),  8 [5500.1] (  9 ),  9 [800.0] (), 10 [800.8] ( 11 )
                11 [800.0] (), 12 [800.0] ( 13 ), 13 [800.0] (), 14 [800.0] ( 15 )
                15 [800.0] (), 16 [800.0] (), 17 [800.0] (), 18 [800.0] (), 19 [800.0] ()
                20 [800.0] (), 21 [799.5] (), 22 [1646.6] (), 23 [800.0] (), 24 [800.0] ()
                25 [800.0] (), 26 [800.0] (), 27 [800.0] (), 28 [800.0] (), 29 [800.0] ()
                30 [800.7] (), 31 [800.0] ()
        
System load averages (1min, 5min, 15min) : 1.0 %, 0.7 %, 0.3 %
Hyperthreading is enabled


Simulating `spiceModels.ams' on pantin at 11:18:22 AM, Wed Jan 28, 2026 (process id: 860610).
Current working directory: /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_switch/ams/config/netlist
Command line:
    /usr/local/cadence/spectre/tools/bin/spectre -64 spiceModels.ams  \
        +config  \
        /usr/local/cadence/spectre/tools.lnx86/spectre/etc/configs/ams.cfg  \
        -ahdllibdir xcelium.d/AMSD/ahdlSimDB -raw ../psf  \
        -I/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/  \
        +ams_control=xcelium.d/AMSD/ams_ctrl/ams_ctrl_860342_pantin
Spectre Licensing Information:
Spectre [11:18:22.090489] Configured Lic search path (22.01-s002): 30000@cadence.cnfm.fr

Spectre Licensing Information:
Spectre [11:18:22.154377] Periodic Lic check successful

Loading /usr/local/cadence/spectre/tools.lnx86/cmi/lib/64bit/5.0/libinfineon_sh.so ...
Loading /usr/local/cadence/spectre/tools.lnx86/cmi/lib/64bit/5.0/libphilips_I_sh.so ...
Loading /usr/local/cadence/spectre/tools.lnx86/cmi/lib/64bit/5.0/libphilips_sh.so ...
Loading /usr/local/cadence/spectre/tools.lnx86/cmi/lib/64bit/5.0/libsparam_sh.so ...
Loading /usr/local/cadence/spectre/tools.lnx86/cmi/lib/64bit/5.0/libstmodels_sh.so ...
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_switch/ams/config/netlist/spiceModels.ams

Notice from spectre during circuit read-in.
    Configuration file used: `/usr/local/cadence/spectre/tools.lnx86/spectre/etc/configs/ams.cfg'.

Reading link:  /usr/local/cadence/spectre
Reading file:  /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/configs/spectre.cfg
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_switch/ams/config/netlist/spiceModels.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/config.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/param.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/bip.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/tm_bip.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpva.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpva3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvb3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvc3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnva.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvba.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvbb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvca.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvcb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvhscr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvascr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvhbscr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pe.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pf.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pe.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pf.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pe.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pf.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/cap.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/tm_cap.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csandwt3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csandwt4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csandwt5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf2p.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf3p.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf3a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf4a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf5a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft4a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft5a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft6a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cif3a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cif4a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cif5a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cift4a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cift5a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cift6a.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm4t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm5t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm6t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmm4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmm4t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmm5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmm5t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh4t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh5t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh6t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmmh4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmmh4t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmmh5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmmh5t.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc_pmos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvci.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvci_nmos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvci_m.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3_pmos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3i_nmos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3i_m.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpod.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpod_i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpodhv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpodhv_i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cp1sub.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cp1suba.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cp1subp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/p_cap.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/tag_25v.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/tag_60v.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/dio.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/tm_dio.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnn3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dp3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnw3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddnwmv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdnwmv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dipdnwmv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddnwa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dipdnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnhpw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnhpwa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dphnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dphnwa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dhpw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dhnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dndf.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdwhn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dwhn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpwhn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpndf.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdddnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddpldnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn3dpl.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dbn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpol.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnpdd_scr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdd_scr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dsb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dsba.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dsba_qp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnp20.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpp20.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn3sci.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dscidnwmv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/mos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/tm_mos.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei_a_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei_a_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nel.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/neli.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/neli_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/neli_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pel.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pel_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/peli.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/peli_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/peli_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nn3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i_a_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i_a_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3ln.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3ln_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lni.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lni_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lni_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3_mos1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_mos1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelna.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelnai.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelnai_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelnai_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lna.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lnai.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lnai_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lnai_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lna.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lna_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lnai.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lnai_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lnai_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/jf_nmma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmma_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/jf_pmma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmma_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedi.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedi_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedia.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedia_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped2_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhv_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhv_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhv_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhv_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmc_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmc_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmd_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmd_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmc_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmc_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nma_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phv_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phv_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phhv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phhv_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phhv_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmc_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmc_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmmc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmmc_mos2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmmc_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pma.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pma_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvti.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvti_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvti_m_6.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvt_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvti.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvti_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvti_m_5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhvd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhvd_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhvd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhvd_bjt.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/photo.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/tm_pho.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoa.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dpho.va
Reading link:  /usr/local/cadence/spectre/tools.lnx86/spectre/etc/ahdl/discipline.h
Reading file:  /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/ahdl/disciplines.vams
Reading link:  /usr/local/cadence/spectre/tools.lnx86/spectre/etc/ahdl/constants.h
Reading file:  /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/ahdl/constants.vams
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphob.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/iphoto_uv.va
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc_cat.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc0_cat.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphocfp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphocfp_cat.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod_an1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod_an2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod0_an1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod0_an2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphodfp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphodfp_an1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphodfp_an2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspada0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/ispad.va
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/iphoto_apd_trig.va
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb_jun.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb_trig.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb0_jun.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/ispad_trig.va
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb_jun.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb_trig.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb0_jun.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspbfep.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapda.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/iphoto_apd.va
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapda_cat.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapda0.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspada.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspada_cat.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/res.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/tm_res.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn_esd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp_io.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp_esd.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw_scr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn3s.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw3_scr.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdnwmv.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1_3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1_3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1s.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1s_3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1h.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1h_3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1k1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1k1_3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rctdn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rctdp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rctp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsildn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsildp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsilnp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsilpp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdn.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdn3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdp3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbnp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbpp1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbpp1k1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm1.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm2.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm3.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm4.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm5.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rmtp.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rmtpl.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/pfuse.scs
Reading file:  /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/s_res.scs
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_switch/ams/config/netlist/amsControlSpectre.scs
Reading file:  /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_switch/ams/config/netlist/.amsbind.scs
Reading file:  /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/configs/ams.cfg
Time for NDB Parsing: CPU = 140.239 ms, elapsed = 537.215 ms.
Time accumulated: CPU = 206.249 ms, elapsed = 537.216 ms.
Peak resident memory used = 196 Mbytes.

Time for Elaboration: CPU = 7.701 ms, elapsed = 7.73191 ms.
Time accumulated: CPU = 213.98 ms, elapsed = 544.978 ms.
Peak resident memory used = 206 Mbytes.


Notice from spectre during hierarchy flattening.
    The value 'psf' specified for the 'checklimitdest' option will no longer be supported in future releases. Use 'spectre -h' to see other recommended values for the 'checklimitdest' option.


Time for EDB Visiting: CPU = 201 us, elapsed = 200.987 us.
Time accumulated: CPU = 214.215 ms, elapsed = 545.212 ms.
Peak resident memory used = 207 Mbytes.


Notice from spectre during topology check.
    Only one connection to the following 3 nodes:
        vdd!
        test_switch.R
        test_switch.net3
Warning from spectre during topology check.
    WARNING (SPECTRE-690): No DC path from current source node `test_switch.net04' to ground. Gmin is installed to provide path, however this can lead to high voltage situation. Ensure to check the circuit for any design issues.


Netlist title:
        //


Global user options:
         psfversion = 1.4.0
               temp = 27
            vabstol = 1e-06
            iabstol = 1e-12
               gmin = 1e-12
             rforce = 1
           maxnotes = 5
           maxwarns = 5
             digits = 5
             pivrel = 0.001
     checklimitdest = psf
               save = selected
               tnom = 27
              scale = 1
             scalem = 1
             reltol = 0.001

Scoped user options:

Circuit inventory:
              nodes 7
            isource 1     
               vcvs 1     
            vsource 3     

Analysis and control statement inventory:
                 dc 1     
               info 7     

Output statements:
             .probe 0     
           .measure 0     
               save 15    

Time for parsing: CPU = 776 us, elapsed = 6.43706 ms.
Time accumulated: CPU = 215.009 ms, elapsed = 551.666 ms.
Peak resident memory used = 209 Mbytes.

~~~~~~~~~~~~~~~~~~~~~~
Pre-Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~

******************
DC Analysis `dcOp'
******************

Opening the PSF file ../psf/dcOp.dc ...
Important parameter values:
    reltol = 1e-03
    abstol(V) = 1 uV
    abstol(I) = 1 pA
    temp = 27 C
    tnom = 27 C
    tempeffects = all
    gmindc = 1 pS
Trying `homotopy = gmin'.

Homotopy: gmin, steps: 5
Trying `homotopy = source'.

Homotopy: source, steps: 22
Trying `homotopy = dptran'...
Homotopy: dptran, steps: 167
Trying `homotopy = ptran'..
Homotopy: ptran, steps: 23
Trying `homotopy = arclength'.

None of the instantiated devices support arclength homotopy. Skipping.

Arclength failed after a total of 0 iterations.
Attempting Newton loop with latest solution.

Perform DC simulation with solver optimization
Trying `homotopy = gmin'.

Homotopy: gmin, steps: 5
Trying `homotopy = source'.

Homotopy: source, steps: 22
Trying `homotopy = dptran'...
Homotopy: dptran, steps: 38
Trying `homotopy = ptran'..
Homotopy: ptran, steps: 23
Trying `homotopy = arclength'.

None of the instantiated devices support arclength homotopy. Skipping.

Arclength failed after a total of 0 iterations.
Attempting Newton loop with latest solution.

Error found by spectre during DC analysis `dcOp'.
    ERROR (SPECTRE-16385): There were 15 attempts to find the DC solution. In some of those attempts, a signal exceeded the blowup limit of its quantity. The last signal that failed is V(test_switch.R) = 1.00001 GV, for which the quantity is `V' and the blowup limit is (1 GV). It is possible that the circuit has no DC solution. If you really want signals this large, set the `blowup' parameter of this quantity to a larger value.
    ERROR (SPECTRE-16080): Cannot print DC solution because DC did not converge. Resolve the convergence issue and rerun the simulation.
         


The following set of suggestions might help you avoid convergence difficulties.  After you have a solution, write it to a nodeset file by using the `write' parameter, and read it back in on subsequent simulations by using the `readns' parameter.

 1. Enable diagnostic messages using the `+diagnose' option.

 2. Evaluate and resolve any notice, warning, or error messages.
 3. Perform sanity check on the parameter values by using the parameter range checker (use ``+param param-limits-file'' as a command line argument) and heed any warnings.  Print the minimum and maximum parameter value by using `info' analysis.  Ensure that the bounds given for instance, model, output, temperature-dependent, and operating-point (if possible) parameters are reasonable.

 4. Check the direction of both independent and dependent current sources. Convergence problems might result if current sources are connected such that they force current backward through diodes.
 5. Small floating resistors connected to high impedance nodes can cause convergence difficulties. Avoid very small floating resistors, particularly small parasitic resistors in semiconductors. Instead, use voltage sources or iprobes to measure current.
 6. If you have an estimate of what the solution should be, use nodeset statements or a nodeset file, and set as many nodes as possible.
 7. Use realistic device models. Check all component parameters, particularly nonlinear device model parameters, to ensure that they are reasonable.
 8. If simulating a bipolar analog circuit, ensure that the region parameter on all transistors and diodes is set correctly.
 9. Loosen tolerances, particularly absolute tolerances like `iabstol' (on options statement). If tolerances are set too tight, they might preclude convergence.
10. Increase the value of gmin (on options statement).
11. Use numeric pivoting in the sparse matrix factorization by setting `pivotdc=yes' (on options statement). Sometimes, it is also necessary to increase the pivot threshold to a value in the range of 0.1 to 0.5 by using `pivrel' (on options statement).
12. Try to simplify the nonlinear component models to avoid regions that might contribute to convergence problems in the model.
13. Divide the circuit into smaller pieces and simulate them individually. However, ensure that the results are close to what they would be if you had simulated the whole circuit.  Use the results to generate nodesets for the whole circuit.
14. Check the connections to ground. Convergence problems might result if no connections to ground. 
15. If all else fails, replace the DC analysis with a transient analysis and modify all the independent sources to start at zero and ramp to their DC values. Run transient analysis well beyond the time when all the sources have reached their final value (remember that transient analysis is very cheap when none of the signals in the circuit are changing) and write the final point to a nodeset file. To make transient analysis more efficient, set the integration method to backward Euler (`method=euler') and loosen the local truncation error criteria by increasing `lteratio', say to 50. Occasionally, this approach fails or is very slow because the circuit contains an oscillator.  Often, for finding the dc solution, the oscillation can be eliminated for by setting the minimum capacitance from each node to ground (`cmin') to a large value.


Maximum value achieved for any signal of each quantity: 
DC simulation time: CPU = 1.245 ms, elapsed = 1.53995 ms.
Analysis `dcOp' was terminated prematurely due to an error.
dcOpInfo: writing operating point information to rawfile.

Opening the PSF file ../psf/dcOpInfo.info ...

Error found by spectre during DC analysis, during info `dcOpInfo'.
    ERROR (SPECTRE-16041): The `dcOpInfo' analysis is skipped due to inability to compute operating point. Run 'mmsimpack' (see mmsimpack -h for detailed usage information) to package the netlist and log files as a compressed tar file. Then, contact your Cadence representative or submit a service request via Cadence Online Support, including the tar file and any other information that could help identify the problem.

Analysis `dcOpInfo' was terminated prematurely due to an error.
modelParameter: writing model parameter values to rawfile.

Opening the PSF file ../psf/modelParameter.info ...
element: writing instance parameter values to rawfile.

Opening the PSF file ../psf/element.info ...
outputParameter: writing output parameter values to rawfile.

Opening the PSF file ../psf/outputParameter.info ...
designParamVals: writing netlist parameters to rawfile.

Opening the PSFASCII file ../psf/designParamVals.info ...
primitives: writing primitives to rawfile.

Opening the PSFASCII file ../psf/primitives.info.primitives ...
subckts: writing subcircuits to rawfile.

Opening the PSFASCII file ../psf/subckts.info.subckts ...
AMSD: Time accumulated for digital engine, elapsed = 432.968 us.
xmsim: *E,RNALER: Simulation terminated due to analog error.
Memory Usage - Current physical: 78.0M, Current virtual: 311.3M, Peak physical: 78.0M
CPU Usage - 0.0s system + 0.0s user = 0.1s total (3.8% cpu)
xcelium> exit
Spectre Licensing Information:
Spectre Lic Summary:
[11:18:22.304168] Cdslmd servers:30000@cadence.cnfm.fr
[11:18:22.304185] Feature usage summary:
[11:18:22.304186] Virtuoso_Multi_mode_Simulation
[11:18:22.304186] Spectre_AMS_MMSIM_Lk


Aggregate audit (11:18:22 AM, Wed Jan 28, 2026):
Time used: CPU = 228 ms, elapsed = 579 ms, util. = 39.5%.
Time spent in licensing: elapsed = 408 ms, percentage of total = 70.6%.
Peak memory used = 213 Mbytes.
Simulation started at: 11:18:22 AM, Wed Jan 28, 2026, ended at: 11:18:22 AM, Wed Jan 28, 2026, with elapsed time (wall clock): 579 ms.
spectre completes with 3 errors, 1 warning, and 4 notices.
Total License Acquisition Time : 0.408 s.
  xmsim  : License Acquisition Time -- 7e-06 s.
  spectre: License Acquisition Time -- 0.408 s.
xmsim: Memory Usage - Final: 75.8M, Peak: 78.5M, Peak virtual: 375.3M
xmsim: CPU Usage - 0.4s system + 0.5s user = 0.9s total (1.8s, 48.9% cpu)
TOOL:	xrun(64)	24.09-s011: Exiting on Jan 28, 2026 at 11:18:22 CET  (total: 00:00:09)
