TOOL:	xrun(64)	24.09-s011: Started on Feb 05, 2026 at 19:04:45 CET
xrun(64): 24.09-s011: (c) Copyright 1995-2025 Cadence Design Systems, Inc.
xrun: *N,CLEAN: Removing existing directory ./xcelium.d.
/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_gene/entity/vhdl.vhd:
	errors: 0, warnings: 0
xmvhdl_p: Memory Usage - Current physical: 20.4M, Current virtual: 38.3M, Peak physical: 20.4M
\SAR\.DIGITAL_GENE (entity):
	streams: 4, words: 87
xmvhdl_cg: Memory Usage - Current physical: 19.4M, Current virtual: 33.3M, Peak physical: 19.4M
xmvhdl: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.0s, 76.1% cpu)
/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_gene/a1/vhdl.vhd:
	errors: 0, warnings: 0
xmvhdl_p: Memory Usage - Current physical: 20.5M, Current virtual: 38.3M, Peak physical: 20.5M
\SAR\.DIGITAL_GENE:A1 (architecture):
	streams: 1, words: 209
xmvhdl_cg: Memory Usage - Current physical: 19.4M, Current virtual: 33.3M, Peak physical: 19.4M
xmvhdl: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.0s, 98.2% cpu)
/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_part/entity/vhdl.vhd:
	errors: 0, warnings: 0
xmvhdl_p: Memory Usage - Current physical: 19.9M, Current virtual: 38.2M, Peak physical: 19.9M
\SAR\.DIGITAL_PART (entity):
	streams: 16, words: 943
xmvhdl_cg: Memory Usage - Current physical: 19.3M, Current virtual: 33.3M, Peak physical: 19.3M
xmvhdl: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.0s, 100.0% cpu)
/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/digital_part/a3/vhdl.vhd:
	errors: 0, warnings: 0
xmvhdl_p: Memory Usage - Current physical: 20.4M, Current virtual: 38.3M, Peak physical: 20.4M
\SAR\.DIGITAL_PART:A3 (architecture):
	streams: 1, words: 745
xmvhdl_cg: Memory Usage - Current physical: 19.4M, Current virtual: 33.4M, Peak physical: 19.4M
xmvhdl: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.0s, 100.0% cpu)
file: ./netlist.vams
	module SAR.switch:schematic
		errors: 0, warnings: 0
	module SAR.switch2:schematic
		errors: 0, warnings: 0
	module SAR.sar8:schematic
		errors: 0, warnings: 0
	module SAR.test_sar8:schematic
		errors: 0, warnings: 0
file: ./cds_globals.vams
	module worklib.cds_globals:vams
		errors: 0, warnings: 0
file: /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/voltage_gene/verilogams/verilog.vams
	module SAR.voltage_gene:verilogams
		errors: 0, warnings: 0
file: /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/save_es/verilogams/verilog.vams
	module SAR.save_es:verilogams
		errors: 0, warnings: 0
file: /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/SAR/switched_comparator/verilogams/verilog.vams
	module SAR.switched_comparator:verilogams
		errors: 0, warnings: 0
xmvlog: *W,SPDUSD: Include directory /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/ given but not used.
	Total errors/warnings found outside modules and primitives:
		errors: 0, warnings: 1
xmvlog: Memory Usage - Current physical: 27.4M, Current virtual: 53.5M, Peak physical: 27.4M
xmvlog: CPU Usage - 0.0s system + 0.0s user = 0.0s total (0.0s, 100.0% cpu)
AMSD Universal Connect Module UCM is enabled.

		Caching library 'SAR' ....... Done
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
xmelab: *N,MSFLON: Xcelium will initiate mixed signal elaboration, Reason: .amsbind.scs.
	Top level design units:
		test_sar8
		cds_globals
	Discipline resolution Pass...
	Doing auto-insertion of connection elements...
	Connect Rules applied are:
		ConnRules_3V_full_fast
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library SAR
	Generating native compiled code:
		SAR.voltage_gene:verilogams <0x6125e0b3>
			streams:   2, words:   423
		SAR.save_es:verilogams <0x28e114b7>
			streams:   2, words:  2095
		SAR.switched_comparator:verilogams <0x7f822814>
			streams:   3, words:  1722
		SAR.sar8:schematic <0x0ed5bf98>
			streams:   0, words:     0
		SAR.switch:schematic <0x06ab6ea9>
			streams:   0, words:     0
		SAR.switch:schematic <0x66f7dbe2>
			streams:   0, words:     0
		SAR.switch:schematic <0x626f6fd4>
			streams:   0, words:     0
		connectLib.L2E_2:module <0x384be792>
			streams:  15, words:  8739
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
	VHDL Design hierarchy:
		Components:              2       2
		Processes:               6       6
		Signals:                 9       9
	Verilog Design hierarchy:
		Modules:                59      26
		Registers:             467     243
		Scalar wires:           46       -
		Vectored wires:         22       -
		Always blocks:          48      80
		Initial blocks:        267     123
		Cont. assignments:      22      21
		Interconnect:           39       -
		Process Clocks:          3       2
		Simulation timescale:  1ps
	Writing initial simulation snapshot: SAR.test_sar8:config
xmelab: Memory Usage - Final: 79.2M, Peak: 250.0M, Peak virtual: 331.8M
xmelab: CPU Usage - 0.1s system + 0.1s user = 0.2s total (0.2s, 85.5% cpu)
Loading snapshot SAR.test_sar8:config .................... Done
Simulating in AMS-SIE mode...
	Starting analog simulation engine...
AMSD Flexible Release Matrix --- using Spectre from installation:
    /usr/local/cadence/spectre/tools/bin/spectre
AMSD: Using spectre solver with arguments: -ahdllibdir xcelium.d/AMSD/ahdlSimDB +aps.
xcelium> source /usr/local/cadence/xcelium/tools/xcelium/files/xmsimrc
xcelium> source /usr/local/cadence/xcelium/tools/xcelium/files/amsrc
xcelium> 
xcelium> # This is the NC-SIM(R) probe command file
xcelium> # used in the AMS-ADE integration.
xcelium> 
xcelium> 
xcelium> #
xcelium> # Database settings
xcelium> #
xcelium> if { [info exists ::env(AMS_RESULTS_DIR) ] } { set AMS_RESULTS_DIR $env(AMS_RESULTS_DIR)} else {set AMS_RESULTS_DIR "../psf"}
../psf
xcelium> database -open ams_database -into ${AMS_RESULTS_DIR} -default
Created default SHM database ams_database
xcelium> 
xcelium> #
xcelium> # Probe settings
xcelium> #
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.VA}
Created probe 1
xcelium> probe -create -emptyok -database ams_database {test_sar8.clock}
Created probe 2
xcelium> probe -create -emptyok -database ams_database {test_sar8.reset}
Created probe 3
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.comp}
Created probe 4
xcelium> probe -create -emptyok -database ams_database {test_sar8.start}
Created probe 5
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[7]}
Created probe 6
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[6]}
Created probe 7
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[5]}
Created probe 8
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[4]}
Created probe 9
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[3]}
Created probe 10
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[2]}
Created probe 11
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[1]}
Created probe 12
xcelium> probe -create -emptyok -database ams_database {test_sar8.result[0]}
Created probe 13
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.SAm}
Created probe 14
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.SBm}
Created probe 15
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sm[8]}
Created probe 16
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sm[7]}
Created probe 17
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sm[6]}
Created probe 18
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sm[5]}
Created probe 19
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sm[4]}
Created probe 20
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sm[3]}
Created probe 21
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sm[2]}
Created probe 22
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sm[1]}
Created probe 23
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.Sm[0]}
Created probe 24
xcelium> probe -create -emptyok -database ams_database {test_sar8.I19.clkcomp}
Created probe 25
xcelium> 
xcelium> run

Spectre (R) Circuit Simulator
Version 23.1.0.802.isr17 64bit -- 10 Apr 2025
Copyright (C) 1989-2025 Cadence Design Systems, Inc. All rights reserved
        worldwide. Cadence and Spectre are registered trademarks of Cadence
        Design Systems, Inc. All others are the property of their respective
        holders.

Includes RSA BSAFE(R) Cryptographic or Security Protocol Software from RSA
        Security, Inc.

User: ics15   Host: pantin   HostID: C38A0F02   PID: 1083877
Memory  available: 27.0598 GB  physical: 33.0497 GB
Linux   : Rocky Linux release 9.6 (Blue Onyx)
CPU Type: Intel(R) Core(TM) i9-14900
        Socket: Processors [Frequency] (Hyperthreaded Processor)
        0:       0 [3729.5] (  1 ),  1 [800.0] (),  2 [799.5] (  3 )
                 3 [800.0] (),  4 [801.3] (  5 ),  5 [800.4] (),  6 [800.0] ( 
        7 )
                 7 [800.0] (),  8 [800.0] (  9 ),  9 [800.0] (), 10 [800.6] (
        11 )
                11 [800.0] (), 12 [800.0] ( 13 ), 13 [800.0] (), 14 [800.0] (
        15 )
                15 [800.0] (), 16 [800.0] (), 17 [800.0] (), 18 [800.0] (), 19

        [800.0] ()
                20 [800.0] (), 21 [800.0] (), 22 [800.0] (), 23 [4300.0] (), 24
        [800.0] ()
                25 [800.0] (), 26 [800.0] (), 27 [800.0] (), 28 [3243.0] (), 29
        [800.0] ()
                30 [799.4] (), 31 [804.8] ()
        
System load averages (1min, 5min, 15min) : 1.4 %, 1.6 %, 1.3 %
Hyperthreading is enabled
HPC is enabled


Simulating `spiceModels.ams' on pantin at 7:04:54 PM, Thur Feb 5, 2026 (process
        id: 1083877).
Current working directory:
        /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist
Command line:
    /usr/local/cadence/spectre/tools/bin/spectre -64 spiceModels.ams  \
        +config  \
        /usr/local/cadence/spectre/tools.lnx86/spectre/etc/configs/ams.cfg  \
        -ahdllibdir xcelium.d/AMSD/ahdlSimDB +aps -raw ../psf  \
        -I/home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/  \
        +ams_control=xcelium.d/AMSD/ams_ctrl/ams_ctrl_1083547_pantin
Spectre Licensing Information:
Spectre [19:04:54.090553] Configured Lic search path (22.01-s002):
        30000@cadence.cnfm.fr

Spectre Licensing Information:
Spectre [19:04:54.075313] Periodic Lic check successful

Reading file: 
        /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/spiceModels.ams

Notice from spectre during circuit read-in.
    Configuration file used:
        `/usr/local/cadence/spectre/tools.lnx86/spectre/etc/configs/ams.cfg'.

Reading link:  /usr/local/cadence/spectre
Reading file: 
        /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/configs/spectre.cfg
Reading file: 
        /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/xcelium.d/AMSD/ahdlSimDB/SAR__switched_comparator__verilogams__0x10000001_behavioral.va
Reading file: 
        /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/ahdl/constants.vams
Reading file: 
        /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/xcelium.d/AMSD/ahdlSimDB/connectLib__L2E_2__module__0x10000001_behavioral.va
Reading file: 
        /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/xcelium.d/AMSD/ahdlSimDB/SAR__save_es__verilogams__0x10000001_behavioral.va
Reading file: 
        /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/xcelium.d/AMSD/ahdlSimDB/SAR__voltage_gene__verilogams__0x10000001_behavioral.va
Reading file: 
        /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/spiceModels.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/config.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/param.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/bip.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/tm_bip.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpva.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvb.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvc.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpva3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvb3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvc3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnva.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvb.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvba.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvbb.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvc.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvca.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnvcb.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvhscr.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvascr.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpvhbscr.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pa.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pb.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pc.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pd.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pe.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpv_pf.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pa.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pb.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pc.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pd.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pe.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qpl_pf.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pa.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pb.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pc.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pd.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pe.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/bip/qnl_pf.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/cap.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/tm_cap.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csandwt3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csandwt4.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csandwt5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf2p.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf3p.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf4.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft4.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf3a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf4a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csf5a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft4a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft5a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/csft6a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cif3a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cif4a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cif5a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cift4a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cift5a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cift6a.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm4t.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm4.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm5t.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmm6t.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmm4.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmm4t.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmm5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmm5t.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh4t.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh4.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh5t.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cmmh6t.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmmh4.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cdmmh4t.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmmh5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/ctmmh5t.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc_pmos.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvci.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvci_nmos.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvci_m.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3_pmos.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3i.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3i_nmos.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/mosvc3i_m.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpod.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpod_i.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpodhv.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cpodhv_i.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cp1sub.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cp1suba.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/cp1subp.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/p_cap.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/tag_25v.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/cap/tag_60v.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/dio.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/tm_dio.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dp.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnw.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnn3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dp3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnw3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddnwmv.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdnwmv.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dipdnwmv.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddnw.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddnwa.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdnw.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dipdnw.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnhpw.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnhpwa.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dphnw.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dphnwa.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dhpw.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dhnw.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dndf.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdwhn.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dwhn.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpwhn.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpndf.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdddnw.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/ddpldnw.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn3dpl.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dbn.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpol.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnpdd_scr.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpdd_scr.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dsb.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dsba.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dsba_qp1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dnp20.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dpp20.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dn3sci.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/dio/dscidnwmv.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/mos.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/tm_mos.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei_m_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nei_a_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei_m_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pei_a_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nel.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/neli.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/neli_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/neli_m_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pel.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pel_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/peli.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/peli_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/peli_m_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nn3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i_m_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3i_a_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i_m_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3i_a_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3ln.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3ln_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lni.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lni_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lni_m_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3_mos1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3_mos2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_mos1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_mos2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nd3i_m_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelna.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelnai.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelnai_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nelnai_m_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lna.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lnai.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lnai_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ne3lnai_m_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lna.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lna_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lnai.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lnai_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pe3lnai_m_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmma.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/jf_nmma.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmma_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmma.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/jf_pmma.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmma_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedi.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedi_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedia.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nedia_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped2_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/ped_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhv.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhv_mos2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhv_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhv.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhv_mos2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhv_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmc.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmc_mos2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmc_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmd.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmd_mos2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmmd_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmc.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmc_mos2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nmc_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nma.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nma_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phv.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phv_mos2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phv_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phhv.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phhv_mos2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/phhv_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmc.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmc_mos2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmc_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmmc.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmmc_mos2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmmc_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pma.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pma_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pmb.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvti.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvti_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nesvti_m_6.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvt_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvti.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvti_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/pesvti_m_5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhvd.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhvd_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhvd.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/mos/nhhvd_bjt.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/photo.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/tm_pho.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoa.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dpho.va
Reading link: 
        /usr/local/cadence/spectre/tools.lnx86/spectre/etc/ahdl/discipline.h
Reading file: 
        /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/ahdl/disciplines.vams
Reading link: 
        /usr/local/cadence/spectre/tools.lnx86/spectre/etc/ahdl/constants.h
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphob.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/iphoto_uv.va
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc_cat.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc0.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphoc0_cat.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphocfp.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphocfp_cat.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod_an1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod_an2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod0.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod0_an1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphod0_an2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphodfp.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphodfp_an1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dphodfp_an2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspada0.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/ispad.va
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/iphoto_apd_trig.va
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb_jun.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb_trig.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb0.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapb0_jun.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/ispad_trig.va
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb_jun.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb_trig.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb0.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspb0_jun.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspbfep.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapda.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/iphoto_apd.va
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapda_cat.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dapda0.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspada.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/photo/dspada_cat.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/res.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/tm_res.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn_esd.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp_io.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp_esd.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw_scr.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdn3s.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdp3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnw3_scr.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rdnwmv.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1_3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1_3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1s.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1s_3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1h.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rnp1h_3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1k1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rpp1k1_3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rctdn.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rctdp.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rctp1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsildn.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsildp.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsilnp1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsilpp1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdn.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdp.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdn3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbdp3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbnp1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbpp1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rsbpp1k1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm1.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm2.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm3.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm4.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rm5.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rmtp.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/rmtpl.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/pfuse.scs
Reading file: 
        /usr/local/XFAB/xh018/cadence/v10_1/spectre/v10_1_1/lpmos/models/res/s_res.scs
Reading file: 
        /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/amsControlSpectre.scs
Reading file: 
        /home/ics15/ICS_ADC_PROJECT_26/SAR_XFAB_TEMPLATE/Sim/test_sar8/ams/config/netlist/.amsbind.scs
Reading file: 
        /usr/local/cadence/spectre_23.10.802/tools.lnx86/spectre/etc/configs/ams.cfg
Time for NDB Parsing: CPU = 140.121 ms, elapsed = 541.159 ms.
Time accumulated: CPU = 195.904 ms, elapsed = 541.161 ms.
Peak resident memory used = 197 Mbytes.

Compiling ahdlcmi module library for
        connectLib__L2E_2__module__0x10000001_behavioral.
Finished compilation in 524 ms (elapsed) for
        connectLib__L2E_2__module__0x10000001_behavioral.
Installed compiled interface for
        connectLib__L2E_2__module__0x10000001_behavioral.
Compiling ahdlcmi module library for
        SAR__switched_comparator__verilogams__0x10000001_behavioral.
Finished compilation in 504 ms (elapsed) for
        SAR__switched_comparator__verilogams__0x10000001_behavioral.
Installed compiled interface for
        SAR__switched_comparator__verilogams__0x10000001_behavioral.
Compiling ahdlcmi module library for
        SAR__save_es__verilogams__0x10000001_behavioral.
Finished compilation in 461 ms (elapsed) for
        SAR__save_es__verilogams__0x10000001_behavioral.
Installed compiled interface for
        SAR__save_es__verilogams__0x10000001_behavioral.
Compiling ahdlcmi module library for
        SAR__voltage_gene__verilogams__0x10000001_behavioral.
Finished compilation in 519 ms (elapsed) for
        SAR__voltage_gene__verilogams__0x10000001_behavioral.
Installed compiled interface for
        SAR__voltage_gene__verilogams__0x10000001_behavioral.
Time for Elaboration: CPU = 33.965 ms, elapsed = 2.04132 s.
Time accumulated: CPU = 229.898 ms, elapsed = 2.58251 s.
Peak resident memory used = 213 Mbytes.


Notice from spectre during hierarchy flattening.
    The value 'psf' specified for the 'checklimitdest' option will no longer be
        supported in future releases. Use 'spectre -h' to see other recommended
        values for the 'checklimitdest' option.


Time for EDB Visiting: CPU = 1.552 ms, elapsed = 1.55401 ms.
Time accumulated: CPU = 231.506 ms, elapsed = 2.58412 s.
Peak resident memory used = 214 Mbytes.


Notice from spectre during topology check.
    No connections to node `test_sar8.I19___dUmmY_pORt_0_'.
    Only one connection to node `vdd3!'.
    No DC path from node `test_sar8.I19___dUmmY_pORt_0_' to ground, Gmin
        installed to provide path.
Notice from spectre during initial setup.
    Multithreading is disabled due to the size of the design being too small.


Netlist title:
        //


Global user options:
         psfversion = 1.4.0
               temp = 27
            vabstol = 1e-06
            iabstol = 1e-12
           homotopy = 5
              limit = delta
               gmin = 1e-12
             rforce = 1
           maxnotes = 5
           maxwarns = 5
             digits = 5
             pivrel = 0.001
     checklimitdest = psf
      ignorezerovar = yes
               save = selected
               tnom = 27
              scale = 1
             scalem = 1
             reltol = 0.001

Scoped user options:

Circuit inventory:
              nodes 45
            bsim3v3 42    
          capacitor 9     
connectLib__L2E_2__module__0x10000001_behavioral 22    
SAR__save_es__verilogams__0x10000001_behavioral 1     
SAR__switched_comparator__verilogams__0x10000001_behavioral 1     
SAR__voltage_gene__verilogams__0x10000001_behavioral 1     
               vcvs 1     
            vsource 3     

Analysis and control statement inventory:
               info 7     
               tran 1     

Output statements:
             .probe 0     
           .measure 0     
               save 12    


Notice from spectre during initial setup.
    APS enabled.

Time for parsing: CPU = 1.039 ms, elapsed = 7.07078 ms.
Time accumulated: CPU = 232.572 ms, elapsed = 2.59121 s.
Peak resident memory used = 217 Mbytes.

~~~~~~~~~~~~~~~~~~~~~~
Pre-Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~
   -   (APS) Multi-threading. The recommended number of threads is 1, consider
        adding +mt=1 on command line.
~~~~~~~~~~~~~~~~~~~~~~

*************************************************
Transient Analysis `tran': time = (0 s -> 900 us)
*************************************************
Convergence achieved in 13 iterations.
DC simulation time: CPU = 1.597 ms, elapsed = 3.66402 ms.

Opening the PSFXL file ../psf/tran.tran.tran ...
Important parameter values:
    start = 0 s
    outputstart = 0 s
    stop = 900 us
    step = 900 ns
    maxstep = 9 us
    ic = all
    useprevic = no
    skipdc = no
    reltol = 100e-06
    abstol(V) = 1 uV
    abstol(I) = 1 pA
    temp = 27 C
    tnom = 27 C
    tempeffects = all
    errpreset = conservative
    method = gear2only
    lteratio = 10
    relref = alllocal
    cmin = 0 F
    gmin = 1 pS
    rabsshort = 1 mOhm


Notice from spectre during transient analysis `tran'.
    Multithreading is disabled due to the size of the design being too small.


Output and IC/nodeset summary:
                 save   12      (voltage)


Warning from spectre at time = 800 ns during transient analysis `tran'.
    WARNING (SPECTRE-16780): LTE tolerance was temporarily relaxed to step over
        a discontinuity in the signal: test_sar8.Analog_in. Check the design or
        use '+diagnose' to get more information.
    WARNING (SPECTRE-16881): Detected possible convergence difficulties which
        might be related to Verilog-A models. Use the command-line option
        '-ahdllint=warn' to check the Verilog-A modeling issues.
Warning from spectre at time = 10.8 us during transient analysis `tran'.
    WARNING (SPECTRE-16780): LTE tolerance was temporarily relaxed to step over
        a discontinuity in the signal: test_sar8.Analog_in. Check the design or
        use '+diagnose' to get more information.
    WARNING (SPECTRE-16881): Detected possible convergence difficulties which
        might be related to Verilog-A models. Use the command-line option
        '-ahdllint=warn' to check the Verilog-A modeling issues.
Warning from spectre at time = 20.8 us during transient analysis `tran'.
    WARNING (SPECTRE-16780): LTE tolerance was temporarily relaxed to step over
        a discontinuity in the signal: test_sar8.Analog_in. Check the design or
        use '+diagnose' to get more information.
    WARNING (SPECTRE-16881): Detected possible convergence difficulties which
        might be related to Verilog-A models. Use the command-line option
        '-ahdllint=warn' to check the Verilog-A modeling issues.

    tran: time = 22.5 us      (2.5 %), step = 331 ns      (36.8 m%)
    tran: time = 67.5 us      (7.5 %), step = 362.4 ns    (40.3 m%)
    tran: time = 112.5 us    (12.5 %), step = 232.8 ns    (25.9 m%)
    tran: time = 157.5 us    (17.5 %), step = 361.9 ns    (40.2 m%)
    tran: time = 202.5 us    (22.5 %), step = 252.4 ns      (28 m%)
    tran: time = 247.5 us    (27.5 %), step = 361.8 ns    (40.2 m%)
    tran: time = 292.5 us    (32.5 %), step = 241.8 ns    (26.9 m%)
    tran: time = 337.5 us    (37.5 %), step = 361.8 ns    (40.2 m%)
    tran: time = 382.5 us    (42.5 %), step = 267.9 ns    (29.8 m%)
    tran: time = 427.5 us    (47.5 %), step = 361.8 ns    (40.2 m%)
    tran: time = 472.5 us    (52.5 %), step = 231.6 ns    (25.7 m%)
    tran: time = 517.5 us    (57.5 %), step = 361.7 ns    (40.2 m%)
    tran: time = 562.5 us    (62.5 %), step = 255.6 ns    (28.4 m%)
    tran: time = 607.5 us    (67.5 %), step = 361.7 ns    (40.2 m%)
    tran: time = 652.5 us    (72.5 %), step = 160.3 ns    (17.8 m%)
    tran: time = 697.5 us    (77.5 %), step = 361.7 ns    (40.2 m%)
    tran: time = 742.5 us    (82.5 %), step = 361.2 ns    (40.1 m%)
    tran: time = 787.5 us    (87.5 %), step = 361.6 ns    (40.2 m%)
    tran: time = 832.5 us    (92.5 %), step = 71 ns       (7.89 m%)
    tran: time = 877.5 us    (97.5 %), step = 361.5 ns    (40.2 m%)

The analog simulator has reached stop time, please use `analog -stop <new stop time>' to extend the analog stop time.
Simulation stopped via transient analysis stoptime at time 900 US
Memory Usage - Current physical: 103.5M, Current virtual: 339.0M, Peak physical: 103.5M
CPU Usage - 0.1s system + 0.1s user = 0.2s total (2.0% cpu)
xcelium> exit
Number of accepted tran steps =             65470

Maximum value achieved for any signal of each quantity: 
V: V(test_sar8.I19.VA) = 3.974 V
I: I(test_sar8.I19.V1:p) = 9.055 mA
Maximum value of each quantity, excluding Verilog-A modules or dangling current
        sources:
V: V(test_sar8.I19.net2) = 3.522 V
I: I(test_sar8.I19.V1:p) = 9.055 mA

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Post-Transient Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
   -   To further speed up simulation, consider
          add ++aps on command line
   -   Non-default settings that could significantly slow down simulation
          errpreset = conservative, default moderate
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~


During simulation, the CPU load for active processors is :
         0 (52.8 %)      1 (1.7 %)       2 (38.5 %)      3 (3.5 %)
         4 (23.8 %)      5 (2.2 %)       6 (24.4 %)      8 (23.8 %)
         9 (1.7 %)      10 (24.0 %)     12 (23.2 %)     14 (16.3 %)
        16 (4.0 %)      17 (11.6 %)     18 (1.8 %)      19 (1.2 %)
        20 (1.2 %)      21 (2.0 %)      22 (1.3 %)      23 (1.8 %)
        24 (1.2 %)      26 (1.8 %)      27 (1.2 %)      29 (2.8 %)
        30 (1.5 %)      31 (3.2 %)      
        Total: 275.6%
Initial condition solution time: CPU = 1.615 ms, elapsed = 3.6819 ms.
Intrinsic tran analysis time:    CPU = 13.0447 s, elapsed = 3.4094 s.

**** AMSD: Mixed-Signal Activity Statistics ****
Number of A-to-D events:                       0
  Number of A-to-D events in IEs:              0
Number of D-to-A events:                    5905
  Number of D-to-A events in IEs:           5815
Number of VHDL-AMS Breaks:                     0
Number of direct digital accesses:              92

**** AMSD: IE Additional Activity Statistics ****
                                          Detected IEs,    Reporting IEs / Total IEs
Number of IEs with D-to-A X edge:                   22,    22/22
Number of IEs with D-to-A Z edge:                    0,    22/22
Number of IEs with A-to-D X edge:                    0,    22/22
Number of IEs with A-to-D Z edge:                    0,    22/22
List of IEs with max number of D-to-A edges:         8,    22/22
   test_sar8.I19.\Sm[4]__L2E_2__logic     (361)
   test_sar8.I19.\Sm[5]__L2E_2__logic     (361)
   test_sar8.I19.\Sm[6]__L2E_2__logic     (361)
   test_sar8.I19.\Sm[7]__L2E_2__logic     (361)
   test_sar8.I19.\Sp[4]__L2E_2__logic     (361)
   ...
List of IEs with max number of A-to-D edges:         1,    22/22
   test_sar8.I19.\Sm[8]__L2E_2__logic     (0)
Number of IEs with narrow/lost D-to-A pulses:        0
List of IEs with max narrow/lost D-to-A pulses:      1,    22/22
   test_sar8.I19.\Sm[8]__L2E_2__logic     (0)
List of IEs with Vin exceeded limit:                 0,    0/22
List of IEs with Vdd exceeded limit:                 0,    0/22
List of IEs with port current reached ilimit:        0,    0/22

Total time required for tran analysis `tran': CPU = 13.0474 s, elapsed =
        3.41412 s, util. = 382%.
Time accumulated: CPU = 48.5303 s, elapsed = 11.0444 s.
Peak resident memory used = 242 Mbytes.

finalTimeOP: writing operating point information to rawfile.

Opening the PSF file ../psf/finalTimeOP.info ...
modelParameter: writing model parameter values to rawfile.

Opening the PSF file ../psf/modelParameter.info ...
element: writing instance parameter values to rawfile.

Opening the PSF file ../psf/element.info ...
outputParameter: writing output parameter values to rawfile.

Opening the PSF file ../psf/outputParameter.info ...
designParamVals: writing netlist parameters to rawfile.

Opening the PSFASCII file ../psf/designParamVals.info ...
primitives: writing primitives to rawfile.

Opening the PSFASCII file ../psf/primitives.info.primitives ...
subckts: writing subcircuits to rawfile.

Opening the PSFASCII file ../psf/subckts.info.subckts ...
AMSD: Time accumulated for digital engine, elapsed = 80.1871 ms.
Spectre Licensing Information:
Spectre Lic Summary:
[19:05:05.238457] Cdslmd servers:30000@cadence.cnfm.fr
[19:05:05.238472] Feature usage summary:
[19:05:05.238472] Virtuoso_Multi_mode_Simulation
[19:05:05.238472] Spectre_AMS_MMSIM_Lk


Aggregate audit (7:05:05 PM, Thur Feb 5, 2026):
Time used: CPU = 48.7 s, elapsed = 11.1 s, util. = 440%.
Time spent in licensing: elapsed = 411 ms.
Peak memory used = 242 Mbytes.
Simulation started at: 7:04:54 PM, Thur Feb 5, 2026, ended at: 7:05:05 PM, Thur
        Feb 5, 2026, with elapsed time (wall clock): 11.1 s.
spectre completes with 0 errors, 6 warnings, and 9 notices.
Total License Acquisition Time : 0.411 s.
  xmsim  : License Acquisition Time -- 9e-06 s.
  spectre: License Acquisition Time -- 0.411 s.
xmsim: Memory Usage - Final: 95.5M, Peak: 105.2M, Peak virtual: 402.9M
xmsim: CPU Usage - 1.9s system + 50.2s user = 52.1s total (12.5s, 100.0% cpu)
TOOL:	xrun(64)	24.09-s011: Exiting on Feb 05, 2026 at 19:05:05 CET  (total: 00:00:20)
